#include<stdio.h>
void num(int in,int i)
{
    if(i==in+1)
    {
        return;
    }
    num(in,i+1);
    printf("%d ",i); 
    /*
    এখানে প্রিন্ট করে আবার ফাংশন কল করতেসেনা,
    এর আগেই আবার ফাংশন কল করে আরো একটা স্পেস নিয়ে
    নিচ্ছে, এবং সবশেষে রিটার্নের কন্ডিশন সত্যি হলে এখান থেকে রিটার্ন
    করার সময় প্রতিবার প্রিন্ট করছে, তাই শেষেরটা আগে প্রিন্ট হচ্ছে।

    এককথায়, প্রিন্ট করে ফাংশন কল করছেনা, কল করা শেষে রিটার্নের টাইমে
    প্রিন্ট করছে। 
    */
    
}
int main()
{
    int in;
    scanf("%d",&in);
    num(in,1);
    return 0;
}