#include<stdio.h>
int main()
{
    /* যদি আমাদের অনেক বেশি ভেরিয়েবল নিয়ে কাজ করার প্রয়োজন হয়, 
    তখন এটি বেশ কষ্টসাধ্য হয়ে যায় কারন এতোগুলো ভেরিয়েবল আলাদা আলাদা
    নামে ডিক্লেয়ার করাটা ঝামেলাপূর্ন। এই সমস্যাটাই সমাধান হয় Array এর মাধ্যমে।
    এর মাধ্যমে আমরা একই ডাটা টাইপের অনেকগুলো ভেরিয়েবল নিয়ে নিতে পারি।
    এর Syntax:
    Data_Type Array_Name[Number] Ex:int arr[10]; এর মাধ্যমে আমরা বলে দিলাম 
    আমাদের ১০টা ভেরিয়েবল দরকার ইন্টিজার টাইপের। */
    int arr[10];
    /*এখন নিয়ে ত নিলাম কিন্তু প্রত্যেকটা আলাদা আলাদাভাবে এক্সেস কীভাবে হবে?
    এর জন্যে আলাদা আলাদা ইন্ডেক্স আছে, ১ম ভেরিয়েবলের ইন্ডেক্স হয় 0 এবং শেষেরটা
    হয় নাম্বার-1, মাঝখানেও ভেরিয়েলগুলোর সিরিয়ালে একটা ইন্ডেক্স থাকে। যদি আমরা একটা
    নির্দিষ্ট কোনো ভেরিয়েবলকে এক্সেস করতে চাই তাহলে এর Syntax:
    Array_Name[index]  Ex: arr[0] অর্থ্যাৎ arr নামক এরে থেকে ১ম ভেরিয়েবলটাকে 
    আইডেন্টিফাই করলাম এবার এর মধ্যে কাজ করতে পারবো*/
    arr[0]=5;arr[5]=3;
    arr[9]=arr[0]+arr[5];
    printf("%d",arr[9]);
    
    return 0;
}