#include<stdio.h>
int main()
{
    /* 
    নাল ক্যারেক্টার হলো একটি বিশেষ ক্যারেক্টার যার আস্কি ভ্যালু ০,
    এই স্ট্রিং ইনপুটের পরের খালি জায়গায় অটোমেটিক নাল ক্যারেক্টার বসে
    প্রোগ্রামকে বুঝায় ইনপুট এই পর্যন্তই, যাতে এরপরের গার্বেজ ভ্যালু শো না
    করে, তাই স্ট্রিং এর ক্ষেত্রে কতটা ক্যারেক্টার ইনপুট নিতে হবে তার থেকে 
    একঘর বড় স্ট্রিং নিতে হবে। 
    */
   /* 
   যেমন আমি "Gihan" লিখতে চাই, এখানে ৫টা ক্যারেক্টারের জন্যে ৫টা এবং
   নালের জন্যে আরো একটা অর্থ্যাৎ মোট ৬টা ক্যারেক্টারের স্ট্রিং নিতে হবে।
   */
    char as[6];
    scanf("%s",&as);
    printf("%s",as);
    return 0;
}