/*কোনো একটি বড় কাজ একটি ফাংশনে সেট করা থাকলে ঐ ফাংশনকে
কল করেই আমরা ঐ কাজটি করে ফেলতে পারি।

ফাংশনের বেসিক স্ট্রাকচারঃ
 ১.যেকোনো ফাংশনকে মেইন ফাংশন int main() এর বাইরে ডিক্লিয়ার করতে হয়।
 ২.

ফংশনের সিন্টেক্স হয়ঃ
    Return_type Function_Name(input or parameters)
    {

    }
    
    Return Type মানে ফাংশন কাজ শেষে যা আউটপুট বা রিটার্ন দিবে তার ডেটা টাইপ বুঝায়।
    Function Name নিজের ইচ্ছামতো।
    Parameter বলতে যার ভিতরে আমরা ইনপুট নিয়ে কাজ করবো তার ডাটা টাইপ ও একটা ভেরিয়েবল নেওয়া
*/
//Example
#include<stdio.h>
int double_it(int num) //এখানে প্যারামিটার বা ইনপুটকে রাখার জন্যে num ইউজ করা হয়েছে।
{
    num*=2;             //এখানে আমরা num parameter এ যে ইনপুট নিয়েছি তাকে নিয়ে কাজ করেছি।
    return num;         //কাজ শেষে কাজের আউটপুটকে num এ রিটার্ন করেছি। 
}
int main()
{
    int x=10;
    int dbl=double_it(x); //ফাংশনের ভিতরে নিয়ে কাজটা কমপ্লিট করার পর 
                        //কাজের ভ্যালুটাকে রাখতে int dbl নামে ভেরিয়েবল নিয়েছি
                        // এবং ফাংশনটাকে এর ভিতরে কল করেছি তার নামে। ফার্স্ট ব্যাকেটে 
                        //যাকে ফাংশনের ভিতরে পাঠিয়ে যার কাজ করাতে চাই তার নাম(এখানে X)দিয়ে 
                        //তার ভ্যালুকে ফাংশনের ভিতরে পাঠিয়ে দিয়েছি 
    printf("%d",dbl);
    return 0;
}

/*
Return & Parameter এর উপর ভিত্তি করে ফাংশন ৪ প্রকারঃ
    1. Return + Parameter
    2. Return + No Parameter
    3. No Return + Parameter
    4. No Return + No Parameter
*/