#include<stdio.h>
    int z=10; //Global Variable
    int sum()
    {
        int x=10;
        printf("From sum--> %d\n",x);
    }

    int main()
    {
        int x=20;
        printf("From main--> %d\n",x);
        sum();
        return 0;
    }

/*

sum এবং main function এর ভিতরে দুইটা সেম ভেরিয়েবল হলেও তারা আলাদা 
এবং আলাদা আলাদা ভ্যালু স্টোর করে এটা এই প্রোগ্রামটা রান করলেই বুঝা যাবে।
sum এর ভিতরে ডিক্লিয়ার করা x ভেরিয়েবল এর বাইরে কাজ করবেনা আবার main
এর ভিতরে ডিক্লিয়ার করা x ভেরিয়েবল এর বাইরে কাজ করবেনা। 

একটা ভেরিয়েবল যতটুকু এরিয়া পর্যন্ত ভ্যালু স্টোর করে এবং এক্সেস করা যায়, 
ততটুকু এরিয়াকেই ঐ ভেরিয়েবলের Scope বলে। 

কোনো ভেরিয়েবলকে সব ফাংশন থেকে এক্সেস করতে চাইলে একেবারে সব ফাংশনের
বাইরে একে ডিক্লিয়ার করতে হবে, এই ধরনের ভেরিয়েবলকে Global Variable বলে।

*/